var CommonErrorCode=CommonErrorCode||{}; 
CommonErrorCode.protocol={
             "10001":"无错误",
             "10002":"协议参数错误",
             "10003":"json格式错误",
             "10004":"协议中找不到协议号",
             "10005":"找不到协议号对应的方法",
             "10006":"未知错误",
             "10007":"协议中用户ID找不到",
             "10008":"找不到用户",
             "10009":"权限不足",
             "10010":"用户创建失败",
             "10011":"邮件错误",
             "10012":"任务错误",
             "10013":"抽奖错误",
             "10014":"登录过期",
             "10015":"试玩账户不支持",
             "10016":"无错误",
             "10017":"存款余额不足",
             "10018":"额度转换未知错误",
             "10019":"参数错误",
             "10020":"额度转换的授权口令过时",
             "10021":"额度转换超时放弃处理",
             "10022":"加载中",
             "10023":"需要等待一会重新操作",
             "10024":"频繁发送消息",
             "10025":"令牌错误",
             "10026":"服务器关闭"    
};
//不需要提示的错误ID 分发消息后自行处理
var NOT_HINT_ERROR_CODE=NOT_HINT_ERROR_CODE||{}; 
NOT_HINT_ERROR_CODE = {
    "10027" : "ERROR_OUTPUTCARD_WRONG"
};
